/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_back.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hhoyl <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/03 17:19:13 by hhoyl             #+#    #+#             */
/*   Updated: 2021/04/03 17:19:15 by hhoyl            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** добавляет новый элемент в конец списка.
*/

void	ft_lstadd_back(t_list **lst, t_list *n)
{
	t_list *p;

	if (!(*lst))
	{
		*lst = n;
		return ;
	}
	if ((p = ft_lstlast(*lst)) != NULL)
		p->next = n;
}
